backend/app/controllers/shops_controller.rb

  def index
    products = Product.all.map{|prod| ProductSerializer.new(prod).serializable_hash[:data][:attributes] }
---
SELECT "products".* FROM "products"